zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_dma.h
/** @defgroup DMA_LL_EC_DEST_ADDR_UPDATE_MODE Burst Destination Address Update Mode
  * @{
  */
#define LL_DMA_BURST_DEST_ADDR_INCREMENT 0x00000000U   /*!< Destination address pointer is incremented after each
                                                            burst transfer by destination update value                */
#define LL_DMA_BURST_DEST_ADDR_DECREMENT DMA_CBR1_DDEC /*!< Destination address pointer is decremented after each
                                                            burst transfer by destination update value                */
/**
  * @}
  */

#if defined CORTEX_IN_SECURE_STATE
/** @defgroup DMA_LL_EC_SOURCE_SECURITY_ATTRIBUTE Source Security Attribute
  * @{
  */
#define LL_DMA_CHANNEL_NSEC 0x00000000U /*!< NSecure channel */
#define LL_DMA_CHANNEL_SEC  0x00000001U /*!< Secure channel  */
/**
  * @}
  */

/** @defgroup DMA_LL_EC_SOURCE_SECURITY_ATTRIBUTE Source Security Attribute
  * @{
  */
#define LL_DMA_CHANNEL_SRC_NSEC 0x00000000U   /*!< NSecure transfer from the source */
#define LL_DMA_CHANNEL_SRC_SEC  DMA_CTR1_SSEC /*!< Secure transfer from the source  */
/**
  * @}
  */

/** @defgroup DMA_LL_EC_DESTINATION_SECURITY_ATTRIBUTE Destination Security Attribute
  * @{
  */
#define LL_DMA_CHANNEL_DEST_NSEC 0x00000000U   /*!< NSecure transfer from the destination */
#define LL_DMA_CHANNEL_DEST_SEC  DMA_CTR1_DSEC /*!< Secure transfer from the destination  */
/**
  * @}
  */
#endif /* CORTEX_IN_SECURE_STATE */

/** @defgroup DMA_LL_EC_LINKEDLIST_NODE_TYPE Linked list node type
  * @{
  */
#if  defined(LPDMA)
#define LL_DMA_LPDMA_LINEAR_NODE 0x00U /*!< LPDMA node : linear addressing node      */
#endif /* LPDMA */
#define LL_DMA_HPDMA_LINEAR_NODE 0x04U /*!< HPDMA node : linear addressing node      */
#define LL_DMA_HPDMA_2D_NODE     0x08U /*!< HPDMA node : 2 dimension addressing node */

/**
  * @}
  */

/** @defgroup DMA_LL_EC_LINKEDLIST_REGISTER_UPDATE Linked list register update
  * @{
  */
#define LL_DMA_UPDATE_CTR1 DMA_CLLR_UT1 /*!< Update CTR1 register from memory :
                                             available for all DMA channels                */
#define LL_DMA_UPDATE_CTR2 DMA_CLLR_UT2 /*!< Update CTR2 register from memory :
                                             available for all DMA channels                */
#define LL_DMA_UPDATE_CBR1 DMA_CLLR_UB1 /*!< Update CBR1 register from memory :
                                             available for all DMA channels                */
#define LL_DMA_UPDATE_CSAR DMA_CLLR_USA /*!< Update CSAR register from memory :
                                             available for all DMA channels                */
#define LL_DMA_UPDATE_CDAR DMA_CLLR_UDA /*!< Update CDAR register from memory :
                                             available for all DMA channels                */
#define LL_DMA_UPDATE_CTR3 DMA_CLLR_UT3 /*!< Update CTR3 register from memory :
                                             available only for 2D addressing DMA channels */
#define LL_DMA_UPDATE_CBR2 DMA_CLLR_UB2 /*!< Update CBR2 register from memory :
                                             available only for 2D addressing DMA channels */
#define LL_DMA_UPDATE_CLLR DMA_CLLR_ULL /*!< Update CLLR register from memory :
                                             available for all DMA channels                */
/**
  * @}
  */

/** @defgroup DMA_LL_EC_REQUEST_SELECTION Request Selection
  * @{
  */
/* HPDMA requests */
#if defined (LPDMA)
#define LL_HPDMA_REQUEST_FMC_TXRX   (0U)   /*!< HPDMA HW request is FMC_TXRX      */
#define LL_HPDMA_REQUEST_FMC_BCH    (1U)   /*!< HPDMA HW request is FMC_BCH       */
#define LL_HPDMA_REQUEST_OCTOSPI1   (2U)   /*!< HPDMA HW request is OCTOSPI1      */
#define LL_HPDMA_REQUEST_OCTOSPI2   (3U)   /*!< HPDMA HW request is OCTOSPI2      */
#define LL_HPDMA_REQUEST_CRYP1_IN   (4U)   /*!< HPDMA HW request is CRYP1_IN      */
#define LL_HPDMA_REQUEST_CRYP1_OUT  (5U)   /*!< HPDMA HW request is CRYP1_OUT     */
#define LL_HPDMA_REQUEST_HASH       (6U)   /*!< HPDMA HW request is HASH          */
#define LL_HPDMA_REQUEST_SAES_OUT   (7U)   /*!< HPDMA HW request is SAES_OUT      */
#define LL_HPDMA_REQUEST_SAES_IN    (8U)   /*!< HPDMA HW request is SAES_IN       */
#define LL_HPDMA_REQUEST_USART1_RX  (9U)   /*!< HPDMA HW request is USART1_RX     */
#define LL_HPDMA_REQUEST_USART1_TX  (10U)  /*!< HPDMA HW request is USART1_TX     */
#define LL_HPDMA_REQUEST_USART2_RX  (11U)  /*!< HPDMA HW request is USART2_RX     */
#define LL_HPDMA_REQUEST_USART2_TX  (12U)  /*!< HPDMA HW request is USART2_TX     */
#define LL_HPDMA_REQUEST_USART3_RX  (13U)  /*!< HPDMA HW request is USART3_RX     */
#define LL_HPDMA_REQUEST_USART3_TX  (14U)  /*!< HPDMA HW request is USART3_TX     */
#define LL_HPDMA_REQUEST_UART4_RX   (15U)  /*!< HPDMA HW request is UART4_RX      */
#define LL_HPDMA_REQUEST_UART4_TX   (16U)  /*!< HPDMA HW request is UART4_TX      */
#define LL_HPDMA_REQUEST_UART5_RX   (17U)  /*!< HPDMA HW request is UART5_RX      */
#define LL_HPDMA_REQUEST_UART5_TX   (18U)  /*!< HPDMA HW request is UART5_TX      */
#define LL_HPDMA_REQUEST_USART6_RX  (19U)  /*!< HPDMA HW request is USART6_RX     */
#define LL_HPDMA_REQUEST_USART6_TX  (20U)  /*!< HPDMA HW request is USART6_TX     */
#define LL_HPDMA_REQUEST_UART7_RX   (21U)  /*!< HPDMA HW request is UART7_RX      */
#define LL_HPDMA_REQUEST_UART7_TX   (22U)  /*!< HPDMA HW request is UART7_TX      */
#define LL_HPDMA_REQUEST_UART8_RX   (23U)  /*!< HPDMA HW request is UART8_RX      */
#define LL_HPDMA_REQUEST_UART8_TX   (24U)  /*!< HPDMA HW request is UART8_TX      */
#define LL_HPDMA_REQUEST_UART9_RX   (25U)  /*!< HPDMA HW request is UART9_RX      */
#define LL_HPDMA_REQUEST_UART9_TX   (26U)  /*!< HPDMA HW request is UART9_TX      */
#define LL_HPDMA_REQUEST_I2C1_RX    (27U)  /*!< HPDMA HW request is I2C1_RX       */
#define LL_HPDMA_REQUEST_I2C1_TX    (28U)  /*!< HPDMA HW request is I2C1_TX       */
#define LL_HPDMA_REQUEST_I2C1_EVC   (29U)  /*!< HPDMA HW request is I2C1_EVC      */
#define LL_HPDMA_REQUEST_I2C2_RX    (30U)  /*!< HPDMA HW request is I2C2_RX       */
#define LL_HPDMA_REQUEST_I2C2_TX    (31U)  /*!< HPDMA HW request is I2C2_TX       */
#define LL_HPDMA_REQUEST_I2C2_EVC   (32U)  /*!< HPDMA HW request is I2C2_EVC      */
#define LL_HPDMA_REQUEST_I2C3_RX    (33U)  /*!< HPDMA HW request is I2C3_RX       */
#define LL_HPDMA_REQUEST_I2C3_TX    (34U)  /*!< HPDMA HW request is I2C3_TX       */
#define LL_HPDMA_REQUEST_I2C3_EVC   (35U)  /*!< HPDMA HW request is I2C3_EVC      */
#define LL_HPDMA_REQUEST_I2C4_RX    (36U)  /*!< HPDMA HW request is I2C4_RX       */
#define LL_HPDMA_REQUEST_I2C4_TX    (37U)  /*!< HPDMA HW request is I2C4_TX       */
#define LL_HPDMA_REQUEST_I2C4_EVC   (38U)  /*!< HPDMA HW request is I2C4_EVC      */
#define LL_HPDMA_REQUEST_I2C5_RX    (39U)  /*!< HPDMA HW request is I2C5_RX       */
#define LL_HPDMA_REQUEST_I2C5_TX    (40U)  /*!< HPDMA HW request is I2C5_TX       */
#define LL_HPDMA_REQUEST_I2C5_EVC   (41U)  /*!< HPDMA HW request is I2C5_EVC      */
#define LL_HPDMA_REQUEST_I2C6_RX    (42U)  /*!< HPDMA HW request is I2C6_RX       */
#define LL_HPDMA_REQUEST_I2C6_TX    (43U)  /*!< HPDMA HW request is I2C6_TX       */
#define LL_HPDMA_REQUEST_I2C6_EVC   (44U)  /*!< HPDMA HW request is I2C6_EVC      */
#define LL_HPDMA_REQUEST_I2C7_RX    (45U)  /*!< HPDMA HW request is I2C7_RX       */
#define LL_HPDMA_REQUEST_I2C7_TX    (46U)  /*!< HPDMA HW request is I2C7_TX       */
#define LL_HPDMA_REQUEST_I2C7_EVC   (47U)  /*!< HPDMA HW request is I2C7_EVC      */
#define LL_HPDMA_REQUEST_RESERVED48 (48U)  /*!< HPDMA HW request is RESERVED      */
#define LL_HPDMA_REQUEST_SPI1_RX    (49U)  /*!< HPDMA HW request is SPI1_RX       */
#define LL_HPDMA_REQUEST_SPI1_TX    (50U)  /*!< HPDMA HW request is SPI1_TX       */
#define LL_HPDMA_REQUEST_SPI2_RX    (51U)  /*!< HPDMA HW request is SPI2_RX       */
#define LL_HPDMA_REQUEST_SPI2_TX    (52U)  /*!< HPDMA HW request is SPI2_TX       */
#define LL_HPDMA_REQUEST_SPI3_RX    (53U)  /*!< HPDMA HW request is SPI3_RX       */
#define LL_HPDMA_REQUEST_SPI3_TX    (54U)  /*!< HPDMA HW request is SPI3_TX       */
#define LL_HPDMA_REQUEST_SPI4_RX    (55U)  /*!< HPDMA HW request is SPI4_RX       */
#define LL_HPDMA_REQUEST_SPI4_TX    (56U)  /*!< HPDMA HW request is SPI4_TX       */
#define LL_HPDMA_REQUEST_SPI5_RX    (57U)  /*!< HPDMA HW request is SPI5_RX       */
#define LL_HPDMA_REQUEST_SPI5_TX    (58U)  /*!< HPDMA HW request is SPI5_TX       */
#define LL_HPDMA_REQUEST_SPI6_RX    (59U)  /*!< HPDMA HW request is SPI6_RX       */
#define LL_HPDMA_REQUEST_SPI6_TX    (60U)  /*!< HPDMA HW request is SPI6_TX       */
#define LL_HPDMA_REQUEST_SPI7_RX    (61U)  /*!< HPDMA HW request is SPI7_RX       */
#define LL_HPDMA_REQUEST_SPI7_TX    (62U)  /*!< HPDMA HW request is SPI7_TX       */
#define LL_HPDMA_REQUEST_MDF1_FLT0  (63U)  /*!< HPDMA HW request is MDF1_FLT0     */
#define LL_HPDMA_REQUEST_MDF1_FLT1  (64U)  /*!< HPDMA HW request is MDF1_FLT1     */
#define LL_HPDMA_REQUEST_MDF1_FLT2  (65U)  /*!< HPDMA HW request is MDF1_FLT2     */
#define LL_HPDMA_REQUEST_MDF1_FLT3  (66U)  /*!< HPDMA HW request is MDF1_FLT3     */
#define LL_HPDMA_REQUEST_MDF1_FLT4  (67U)  /*!< HPDMA HW request is MDF1_FLT4     */
#define LL_HPDMA_REQUEST_MDF1_FLT5  (68U)  /*!< HPDMA HW request is MDF1_FLT5     */
#define LL_HPDMA_REQUEST_MDF1_FLT6  (69U)  /*!< HPDMA HW request is MDF1_FLT6     */
#define LL_HPDMA_REQUEST_MDF1_FLT7  (70U)  /*!< HPDMA HW request is MDF1_FLT7     */
#define LL_HPDMA_REQUEST_SPDIFRX_DT (71U)  /*!< HPDMA HW request is SPDIFRX_DT    */
#define LL_HPDMA_REQUEST_SPDIFRX_CS (72U)  /*!< HPDMA HW request is SPDIFRX_CS    */
#define LL_HPDMA_REQUEST_SAI1_A     (73U)  /*!< HPDMA HW request is SAI1_A        */
#define LL_HPDMA_REQUEST_SAI1_B     (74U)  /*!< HPDMA HW request is SAI1_B        */
#define LL_HPDMA_REQUEST_SAI2_A     (75U)  /*!< HPDMA HW request is SAI2_A        */
#define LL_HPDMA_REQUEST_SAI2_B     (76U)  /*!< HPDMA HW request is SAI2_B        */
#define LL_HPDMA_REQUEST_SAI3_A     (77U)  /*!< HPDMA HW request is SAI3_A        */
#define LL_HPDMA_REQUEST_SAI3_B     (78U)  /*!< HPDMA HW request is SAI3_B        */
#define LL_HPDMA_REQUEST_SAI4_A     (79U)  /*!< HPDMA HW request is SAI4_A        */
#define LL_HPDMA_REQUEST_SAI4_B     (80U)  /*!< HPDMA HW request is SAI4_B        */
#define LL_HPDMA_REQUEST_ADC1       (81U)  /*!< HPDMA HW request is ADC1          */
#define LL_HPDMA_REQUEST_ADC2       (82U)  /*!< HPDMA HW request is ADC2          */
#define LL_HPDMA_REQUEST_ADC3       (83U)  /*!< HPDMA HW request is ADC3          */
#define LL_HPDMA_REQUEST_TIM1_CH1   (84U)  /*!< HPDMA HW request is TIM1_CH1      */
#define LL_HPDMA_REQUEST_TIM1_CH2   (85U)  /*!< HPDMA HW request is TIM1_CH2      */
#define LL_HPDMA_REQUEST_TIM1_CH3   (86U)  /*!< HPDMA HW request is TIM1_CH3      */
#define LL_HPDMA_REQUEST_TIM1_CH4   (87U)  /*!< HPDMA HW request is TIM1_CH4      */
#define LL_HPDMA_REQUEST_TIM1_UP    (88U)  /*!< HPDMA HW request is TIM1_UP       */
#define LL_HPDMA_REQUEST_TIM1_TRIG  (89U)  /*!< HPDMA HW request is TIM1_TRIG     */
#define LL_HPDMA_REQUEST_TIM1_COM   (90U)  /*!< HPDMA HW request is TIM1_COM      */
#define LL_HPDMA_REQUEST_TIM2_CH1   (91U)  /*!< HPDMA HW request is TIM2_CH1      */
#define LL_HPDMA_REQUEST_TIM2_CH2   (92U)  /*!< HPDMA HW request is TIM2_CH2      */
#define LL_HPDMA_REQUEST_TIM2_CH3   (93U)  /*!< HPDMA HW request is TIM2_CH3      */
#define LL_HPDMA_REQUEST_TIM2_CH4   (94U)  /*!< HPDMA HW request is TIM2_CH4      */
#define LL_HPDMA_REQUEST_TIM2_UP    (95U)  /*!< HPDMA HW request is TIM2_UP       */
#define LL_HPDMA_REQUEST_TIM3_CH1   (96U)  /*!< HPDMA HW request is TIM3_CH1      */
#define LL_HPDMA_REQUEST_TIM3_CH2   (97U)  /*!< HPDMA HW request is TIM3_CH2      */
#define LL_HPDMA_REQUEST_TIM3_CH3   (98U)  /*!< HPDMA HW request is TIM3_CH3      */
#define LL_HPDMA_REQUEST_TIM3_CH4   (99U)  /*!< HPDMA HW request is TIM3_CH4      */
#define LL_HPDMA_REQUEST_TIM3_UP    (100U) /*!< HPDMA HW request is TIM3_UP       */
#define LL_HPDMA_REQUEST_TIM3_TRIG  (101U) /*!< HPDMA HW request is TIM3_TRIG     */
#define LL_HPDMA_REQUEST_TIM4_CH1   (102U) /*!< HPDMA HW request is TIM4_CH1      */
#define LL_HPDMA_REQUEST_TIM4_CH2   (103U) /*!< HPDMA HW request is TIM4_CH2      */
#define LL_HPDMA_REQUEST_TIM4_CH3   (104U) /*!< HPDMA HW request is TIM4_CH3      */
#define LL_HPDMA_REQUEST_TIM4_UP    (105U) /*!< HPDMA HW request is TIM4_UP       */
#define LL_HPDMA_REQUEST_TIM5_CH1   (106U) /*!< HPDMA HW request is TIM5_CH1      */
#define LL_HPDMA_REQUEST_TIM5_CH2   (107U) /*!< HPDMA HW request is TIM5_CH2      */
#define LL_HPDMA_REQUEST_TIM5_CH3   (108U) /*!< HPDMA HW request is TIM5_CH3      */
#define LL_HPDMA_REQUEST_TIM5_CH4   (109U) /*!< HPDMA HW request is TIM5_CH4      */
#define LL_HPDMA_REQUEST_TIM5_UP    (110U) /*!< HPDMA HW request is TIM5_UP       */
#define LL_HPDMA_REQUEST_TIM5_TRIG  (111U) /*!< HPDMA HW request is TIM5_TRIG     */
#define LL_HPDMA_REQUEST_TIM6_UP    (112U) /*!< HPDMA HW request is TIM6_UP       */
#define LL_HPDMA_REQUEST_TIM7_UP    (113U) /*!< HPDMA HW request is TIM7_UP       */
#define LL_HPDMA_REQUEST_TIM8_CH1   (114U) /*!< HPDMA HW request is TIM8_CH1      */
#define LL_HPDMA_REQUEST_TIM8_CH2   (115U) /*!< HPDMA HW request is TIM8_CH2      */
#define LL_HPDMA_REQUEST_TIM8_CH3   (116U) /*!< HPDMA HW request is TIM8_CH3      */
#define LL_HPDMA_REQUEST_TIM8_CH4   (117U) /*!< HPDMA HW request is TIM8_CH4      */
#define LL_HPDMA_REQUEST_TIM8_UP    (118U) /*!< HPDMA HW request is TIM8_UP       */
#define LL_HPDMA_REQUEST_TIM8_TRIG  (119U) /*!< HPDMA HW request is TIM8_TRIG     */
#define LL_HPDMA_REQUEST_TIM8_COM   (120U) /*!< HPDMA HW request is TIM8_COM      */
#define LL_HPDMA_REQUEST_TIM15_CH1  (121U) /*!< HPDMA HW request is TIM15_CH1     */
#define LL_HPDMA_REQUEST_TIM15_UP   (122U) /*!< HPDMA HW request is TIM15_UP      */
#define LL_HPDMA_REQUEST_TIM15_TRIG (123U) /*!< HPDMA HW request is TIM15_TRIG    */
#define LL_HPDMA_REQUEST_TIM15_COM  (124U) /*!< HPDMA HW request is TIM15_COM     */
#define LL_HPDMA_REQUEST_TIM16_CH1  (125U) /*!< HPDMA HW request is TIM16_CH1     */
#define LL_HPDMA_REQUEST_TIM16_UP   (126U) /*!< HPDMA HW request is TIM16_UP      */
#define LL_HPDMA_REQUEST_TIM17_CH1  (127U) /*!< HPDMA HW request is TIM17_CH1     */
#define LL_HPDMA_REQUEST_TIM17_UP   (128U) /*!< HPDMA HW request is TIM17_UP      */
#define LL_HPDMA_REQUEST_TIM20_CH1  (129U) /*!< HPDMA HW request is TIM20_CH1     */
#define LL_HPDMA_REQUEST_TIM20_CH2  (130U) /*!< HPDMA HW request is TIM20_CH2     */
#define LL_HPDMA_REQUEST_TIM20_CH3  (131U) /*!< HPDMA HW request is TIM20_CH3     */
#define LL_HPDMA_REQUEST_TIM20_CH4  (132U) /*!< HPDMA HW request is TIM20_CH4     */
#define LL_HPDMA_REQUEST_TIM20_UP   (133U) /*!< HPDMA HW request is TIM20_UP      */
#define LL_HPDMA_REQUEST_TIM20_TRIG (134U) /*!< HPDMA HW request is TIM20_TRIG    */
#define LL_HPDMA_REQUEST_TIM20_COM  (135U) /*!< HPDMA HW request is TIM20_COM     */
#define LL_HPDMA_REQUEST_PCIE       (136U) /*!< HPDMA HW request is PCIE          */
#define LL_HPDMA_REQUEST_DCMI       (137U) /*!< HPDMA HW request is DCMI          */
#define LL_HPDMA_REQUEST_UCPD_TX    (138U) /*!< HPDMA HW request is UCPD_TX       */
#define LL_HPDMA_REQUEST_UCPD_RX    (139U) /*!< HPDMA HW request is UCPD_RX       */
#define LL_HPDMA_REQUEST_CRYP2_IN   (140U) /*!< HPDMA HW request is CRYP2_IN      */
#define LL_HPDMA_REQUEST_CRYP2_OUT  (141U) /*!< HPDMA HW request is CRYP2_OUT     */
#define LL_HPDMA_REQUEST_TIM4_CH4   (142U) /*!< HPDMA HW request is TIM4_CH4      */
#define LL_HPDMA_REQUEST_LPTIM1_IC1 (143U) /*!< HPDMA HW request is LPTIM1_IC1    */
#define LL_HPDMA_REQUEST_LPTIM1_IC2 (144U) /*!< HPDMA HW request is LPTIM1_IC2    */
#define LL_HPDMA_REQUEST_LPTIM1_UE  (145U) /*!< HPDMA HW request is LPTIM1_UE     */
#define LL_HPDMA_REQUEST_LPTIM2_IC1 (146U) /*!< HPDMA HW request is LPTIM2_IC1    */
#define LL_HPDMA_REQUEST_LPTIM2_IC2 (147U) /*!< HPDMA HW request is LPTIM2_IC2    */
#define LL_HPDMA_REQUEST_LPTIM2_UE  (148U) /*!< HPDMA HW request is LPTIM2_UE     */
#define LL_HPDMA_REQUEST_TIM2_TRIG  (149U) /*!< HPDMA HW request is TIM2_TRIG     */
#define LL_HPDMA_REQUEST_TIM4_TRIG  (150U) /*!< HPDMA HW request is TIM4_TRIG     */
#define LL_HPDMA_REQUEST_TIM15_CH2  (151U) /*!< HPDMA HW request is TIM15_CH2     */
#define LL_HPDMA_REQUEST_TIM16_COM  (152U) /*!< HPDMA HW request is TIM16_COM     */
#define LL_HPDMA_REQUEST_TIM17_COM  (153U) /*!< HPDMA HW request is TIM17_COM     */
#define LL_HPDMA_REQUEST_I3C1_RX    (154U) /*!< HPDMA HW request is I3C1_RX       */
#define LL_HPDMA_REQUEST_I3C1_TX    (155U) /*!< HPDMA HW request is I3C1_TX       */
#define LL_HPDMA_REQUEST_I3C1_CMD   (156U) /*!< HPDMA HW request is I3C1_CMD      */
#define LL_HPDMA_REQUEST_I3C1_STAT  (157U) /*!< HPDMA HW request is I3C1_STAT     */
#define LL_HPDMA_REQUEST_I3C2_RX    (158U) /*!< HPDMA HW request is I3C2_RX       */
#define LL_HPDMA_REQUEST_I3C2_TX    (159U) /*!< HPDMA HW request is I3C2_TX       */
#define LL_HPDMA_REQUEST_I3C2_CMD   (160U) /*!< HPDMA HW request is I3C2_CMD      */
#define LL_HPDMA_REQUEST_I3C2_STAT  (161U) /*!< HPDMA HW request is I3C2_STAT     */
#define LL_HPDMA_REQUEST_I3C3_RX    (162U) /*!< HPDMA HW request is I3C3_RX       */
#define LL_HPDMA_REQUEST_I3C3_TX    (163U) /*!< HPDMA HW request is I3C3_TX       */
#define LL_HPDMA_REQUEST_I3C3_CMD   (164U) /*!< HPDMA HW request is I3C3_CMD      */
#define LL_HPDMA_REQUEST_I3C3_STAT  (165U) /*!< HPDMA HW request is I3C3_STAT     */
#if !defined(STM32MP25XX_SI_CUT1_X)
#define LL_HPDMA_REQUEST_LPUART1_RX (166U) /*!< HPDMA HW request is LPUART1_RX    */
#define LL_HPDMA_REQUEST_LPUART1_TX (167U) /*!< HPDMA HW request is LPUART1_TX    */
#define LL_HPDMA_REQUEST_I2C8_RX    (168U) /*!< HPDMA HW request is I2C8_RX       */
#define LL_HPDMA_REQUEST_I2C8_TX    (169U) /*!< HPDMA HW request is I2C8_TX       */
#define LL_HPDMA_REQUEST_I2C8_EVC   (170U) /*!< HPDMA HW request is I2C8_EVC      */
#define LL_HPDMA_REQUEST_SPI8_RX    (171U) /*!< HPDMA HW request is SPI8_RX       */
#define LL_HPDMA_REQUEST_SPI8_TX    (172U) /*!< HPDMA HW request is SPI8_TX       */
#define LL_HPDMA_REQUEST_ADF1_FLT0  (173U) /*!< HPDMA HW request is ADF1_FLT0     */
#define LL_HPDMA_REQUEST_LPTIM3_IC1 (174U) /*!< HPDMA HW request is LPTIM3_IC1    */
#define LL_HPDMA_REQUEST_LPTIM3_IC2 (175U) /*!< HPDMA HW request is LPTIM3_IC2    */
#define LL_HPDMA_REQUEST_LPTIM3_UE  (176U) /*!< HPDMA HW request is LPTIM3_UE     */
#define LL_HPDMA_REQUEST_LPTIM4_IC1 (177U) /*!< HPDMA HW request is LPTIM4_IC1    */
#define LL_HPDMA_REQUEST_LPTIM4_IC2 (178U) /*!< HPDMA HW request is LPTIM4_IC2    */
#define LL_HPDMA_REQUEST_LPTIM4_UE  (179U) /*!< HPDMA HW request is LPTIM4_UE     */
#define LL_HPDMA_REQUEST_I3C4_RX    (180U) /*!< HPDMA HW request is I3C4_RX       */
#define LL_HPDMA_REQUEST_I3C4_TX    (181U) /*!< HPDMA HW request is I3C4_TX       */
#define LL_HPDMA_REQUEST_I3C4_CMD   (182U) /*!< HPDMA HW request is I3C4_CMD      */
#define LL_HPDMA_REQUEST_I3C4_STAT  (183U) /*!< HPDMA HW request is I3C4_STAT     */
#endif


/* LPDMA requests */
#define LL_LPDMA_REQUEST_LPUART1_RX (0U)   /*!< LPDMA HW request is LPUART1_RX    */
#define LL_LPDMA_REQUEST_LPUART1_TX (1U)   /*!< LPDMA HW request is LPUART1_TX    */
#define LL_LPDMA_REQUEST_I2C8_RX    (2U)   /*!< LPDMA HW request is I2C8_RX       */
#define LL_LPDMA_REQUEST_I2C8_TX    (3U)   /*!< LPDMA HW request is I2C8_TX       */
#define LL_LPDMA_REQUEST_I2C8_EVC   (4U)   /*!< LPDMA HW request is I2C8_EVC      */
#define LL_LPDMA_REQUEST_SPI8_RX    (5U)   /*!< LPDMA HW request is SPI8_RX       */
#define LL_LPDMA_REQUEST_SPI8_TX    (6U)   /*!< LPDMA HW request is SPI8_TX       */
#define LL_LPDMA_REQUEST_ADF1_FLT0  (7U)   /*!< LPDMA HW request is ADF1_FLT0     */
#define LL_LPDMA_REQUEST_LPTIM3_IC1 (8U)   /*!< LPDMA HW request is LPTIM3_IC1    */
#define LL_LPDMA_REQUEST_LPTIM3_IC2 (9U)   /*!< LPDMA HW request is LPTIM3_IC2    */
#define LL_LPDMA_REQUEST_LPTIM3_UE  (10U)  /*!< LPDMA HW request is LPTIM3_UE     */
#define LL_LPDMA_REQUEST_LPTIM4_IC1 (11U)  /*!< LPDMA HW request is LPTIM4_IC1    */
#define LL_LPDMA_REQUEST_LPTIM4_IC2 (12U)  /*!< LPDMA HW request is LPTIM4_IC2    */
#define LL_LPDMA_REQUEST_LPTIM4_UE  (13U)  /*!< LPDMA HW request is LPTIM4_UE     */
#define LL_LPDMA_REQUEST_I3C4_RX    (15U)  /*!< LPDMA HW request is I3C4_RX       */
#define LL_LPDMA_REQUEST_I3C4_TX    (16U)  /*!< LPDMA HW request is I3C4_TX       */
#define LL_LPDMA_REQUEST_I3C4_CMD   (17U)  /*!< LPDMA HW request is I3C4_CMD      */
#define LL_LPDMA_REQUEST_I3C4_STAT  (18U)  /*!< LPDMA HW request is I3C4_STAT     */

#else

