zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_dma.h
/** @defgroup DMA_LL_EC_TRIGGER_SELECTION Trigger Selection
  * @{
  */
/* HPDMA triggers */
#if defined(LPDMA)
#define LL_HPDMA_TRIGGER_EXTI_LINE0      (0U)  /*!< HPDMA HW Trigger signal is EXTI_LINE0      */
#define LL_HPDMA_TRIGGER_EXTI_LINE1      (1U)  /*!< HPDMA HW Trigger signal is EXTI_LINE1      */
#define LL_HPDMA_TRIGGER_EXTI_LINE2      (2U)  /*!< HPDMA HW Trigger signal is EXTI_LINE2      */
#define LL_HPDMA_TRIGGER_EXTI_LINE3      (3U)  /*!< HPDMA HW Trigger signal is EXTI_LINE3      */
#define LL_HPDMA_TRIGGER_EXTI_LINE4      (4U)  /*!< HPDMA HW Trigger signal is EXTI_LINE4      */
#define LL_HPDMA_TRIGGER_EXTI_LINE5      (5U)  /*!< HPDMA HW Trigger signal is EXTI_LINE5      */
#define LL_HPDMA_TRIGGER_EXTI_LINE6      (6U)  /*!< HPDMA HW Trigger signal is EXTI_LINE6      */
#define LL_HPDMA_TRIGGER_EXTI_LINE7      (7U)  /*!< HPDMA HW Trigger signal is EXTI_LINE7      */
#define LL_HPDMA_TRIGGER_EXTI_LINE8      (8U)  /*!< HPDMA HW Trigger signal is EXTI_LINE8      */
#define LL_HPDMA_TRIGGER_EXTI_LINE9      (9U)  /*!< HPDMA HW Trigger signal is EXTI_LINE9      */
#define LL_HPDMA_TRIGGER_EXTI_LINE10     (10U) /*!< HPDMA HW Trigger signal is EXTI_LINE10     */
#define LL_HPDMA_TRIGGER_EXTI_LINE11     (11U) /*!< HPDMA HW Trigger signal is EXTI_LINE11     */
#define LL_HPDMA_TRIGGER_EXTI_LINE12     (12U) /*!< HPDMA HW Trigger signal is EXTI_LINE12     */
#define LL_HPDMA_TRIGGER_EXTI_LINE13     (13U) /*!< HPDMA HW Trigger signal is EXTI_LINE13     */
#define LL_HPDMA_TRIGGER_EXTI_LINE14     (14U) /*!< HPDMA HW Trigger signal is EXTI_LINE14     */
#define LL_HPDMA_TRIGGER_EXTI_LINE15     (15U) /*!< HPDMA HW Trigger signal is EXTI_LINE15     */
#define LL_HPDMA_TRIGGER_LPTIM1_CH1      (16U) /*!< HPDMA HW Trigger signal is LPTIM1_CH1      */
#define LL_HPDMA_TRIGGER_LPTIM2_CH1      (17U) /*!< HPDMA HW Trigger signal is LPTIM2_CH1      */
#define LL_HPDMA_TRIGGER_LPTIM3_CH1      (18U) /*!< HPDMA HW Trigger signal is LPTIM3_CH1      */
#define LL_HPDMA_TRIGGER_LPTIM4_CH1      (19U) /*!< HPDMA HW Trigger signal is LPTIM4_CH1      */
#define LL_HPDMA_TRIGGER_LPTIM5_CH1      (20U) /*!< HPDMA HW Trigger signal is LPTIM5_CH1      */
#define LL_HPDMA_TRIGGER_RTC_ALRA_TRG    (21U) /*!< HPDMA HW Trigger signal is RTC_ALRA_TRG    */
#define LL_HPDMA_TRIGGER_RTC_ALRB_TRG    (22U) /*!< HPDMA HW Trigger signal is RTC_ALRB_TRG    */
#define LL_HPDMA_TRIGGER_RTC_WUT_TRG     (23U) /*!< HPDMA HW Trigger signal is RTC_WUT_TRG     */
#define LL_HPDMA_TRIGGER_LPDMA_CH0_TCF   (24U) /*!< HPDMA HW Trigger signal is LL_LPDMA_CH0_TCF   */
#define LL_HPDMA_TRIGGER_LPDMA_CH1_TCF   (25U) /*!< HPDMA HW Trigger signal is LL_LPDMA_CH1_TCF   */
#define LL_HPDMA_TRIGGER_LPDMA_CH2_TCF   (26U) /*!< HPDMA HW Trigger signal is LL_LPDMA_CH2_TCF   */
#define LL_HPDMA_TRIGGER_LPDMA_CH3_TCF   (27U) /*!< HPDMA HW Trigger signal is LL_LPDMA_CH3_TCF   */
#define LL_HPDMA_TRIGGER_HPDMA1_CH0_TCF  (28U) /*!< HPDMA HW Trigger signal is HPDMA1_CH0_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA1_CH1_TCF  (29U) /*!< HPDMA HW Trigger signal is HPDMA1_CH1_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA1_CH2_TCF  (30U) /*!< HPDMA HW Trigger signal is HPDMA1_CH2_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA1_CH3_TCF  (31U) /*!< HPDMA HW Trigger signal is HPDMA1_CH3_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA1_CH4_TCF  (32U) /*!< HPDMA HW Trigger signal is HPDMA1_CH4_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA1_CH5_TCF  (33U) /*!< HPDMA HW Trigger signal is HPDMA1_CH5_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA1_CH6_TCF  (34U) /*!< HPDMA HW Trigger signal is HPDMA1_CH6_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA1_CH7_TCF  (35U) /*!< HPDMA HW Trigger signal is HPDMA1_CH7_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA1_CH8_TCF  (36U) /*!< HPDMA HW Trigger signal is HPDMA1_CH8_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA1_CH9_TCF  (37U) /*!< HPDMA HW Trigger signal is HPDMA1_CH9_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA1_CH10_TCF (38U) /*!< HPDMA HW Trigger signal is HPDMA1_CH10_TCF */
#define LL_HPDMA_TRIGGER_HPDMA1_CH11_TCF (39U) /*!< HPDMA HW Trigger signal is HPDMA1_CH11_TCF */
#define LL_HPDMA_TRIGGER_HPDMA1_CH12_TCF (40U) /*!< HPDMA HW Trigger signal is HPDMA1_CH12_TCF */
#define LL_HPDMA_TRIGGER_HPDMA1_CH13_TCF (41U) /*!< HPDMA HW Trigger signal is HPDMA1_CH13_TCF */
#define LL_HPDMA_TRIGGER_HPDMA1_CH14_TCF (42U) /*!< HPDMA HW Trigger signal is HPDMA1_CH14_TCF */
#define LL_HPDMA_TRIGGER_HPDMA1_CH15_TCF (43U) /*!< HPDMA HW Trigger signal is HPDMA1_CH15_TCF */
#define LL_HPDMA_TRIGGER_HPDMA2_CH0_TCF  (44U) /*!< HPDMA HW Trigger signal is HPDMA2_CH0_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA2_CH1_TCF  (45U) /*!< HPDMA HW Trigger signal is HPDMA2_CH1_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA2_CH2_TCF  (46U) /*!< HPDMA HW Trigger signal is HPDMA2_CH2_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA2_CH3_TCF  (47U) /*!< HPDMA HW Trigger signal is HPDMA2_CH3_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA2_CH4_TCF  (48U) /*!< HPDMA HW Trigger signal is HPDMA2_CH4_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA2_CH5_TCF  (49U) /*!< HPDMA HW Trigger signal is HPDMA2_CH5_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA2_CH6_TCF  (50U) /*!< HPDMA HW Trigger signal is HPDMA2_CH6_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA2_CH7_TCF  (51U) /*!< HPDMA HW Trigger signal is HPDMA2_CH7_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA2_CH8_TCF  (52U) /*!< HPDMA HW Trigger signal is HPDMA2_CH8_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA2_CH9_TCF  (53U) /*!< HPDMA HW Trigger signal is HPDMA2_CH9_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA2_CH10_TCF (54U) /*!< HPDMA HW Trigger signal is HPDMA2_CH10_TCF */
#define LL_HPDMA_TRIGGER_HPDMA2_CH11_TCF (55U) /*!< HPDMA HW Trigger signal is HPDMA2_CH11_TCF */
#define LL_HPDMA_TRIGGER_HPDMA2_CH12_TCF (56U) /*!< HPDMA HW Trigger signal is HPDMA2_CH12_TCF */
#define LL_HPDMA_TRIGGER_HPDMA2_CH13_TCF (57U) /*!< HPDMA HW Trigger signal is HPDMA2_CH13_TCF */
#define LL_HPDMA_TRIGGER_HPDMA2_CH14_TCF (58U) /*!< HPDMA HW Trigger signal is HPDMA2_CH14_TCF */
#define LL_HPDMA_TRIGGER_HPDMA2_CH15_TCF (59U) /*!< HPDMA HW Trigger signal is HPDMA2_CH15_TCF */
#define LL_HPDMA_TRIGGER_HPDMA3_CH0_TCF  (60U) /*!< HPDMA HW Trigger signal is HPDMA3_CH0_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA3_CH1_TCF  (61U) /*!< HPDMA HW Trigger signal is HPDMA3_CH1_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA3_CH2_TCF  (62U) /*!< HPDMA HW Trigger signal is HPDMA3_CH2_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA3_CH3_TCF  (63U) /*!< HPDMA HW Trigger signal is HPDMA3_CH3_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA3_CH4_TCF  (64U) /*!< HPDMA HW Trigger signal is HPDMA3_CH4_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA3_CH5_TCF  (65U) /*!< HPDMA HW Trigger signal is HPDMA3_CH5_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA3_CH6_TCF  (66U) /*!< HPDMA HW Trigger signal is HPDMA3_CH6_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA3_CH7_TCF  (67U) /*!< HPDMA HW Trigger signal is HPDMA3_CH7_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA3_CH8_TCF  (68U) /*!< HPDMA HW Trigger signal is HPDMA3_CH8_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA3_CH9_TCF  (69U) /*!< HPDMA HW Trigger signal is HPDMA3_CH9_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA3_CH10_TCF (70U) /*!< HPDMA HW Trigger signal is HPDMA3_CH10_TCF */
#define LL_HPDMA_TRIGGER_HPDMA3_CH11_TCF (71U) /*!< HPDMA HW Trigger signal is HPDMA3_CH11_TCF */
#define LL_HPDMA_TRIGGER_HPDMA3_CH12_TCF (72U) /*!< HPDMA HW Trigger signal is HPDMA3_CH12_TCF */
#define LL_HPDMA_TRIGGER_HPDMA3_CH13_TCF (73U) /*!< HPDMA HW Trigger signal is HPDMA3_CH13_TCF */
#define LL_HPDMA_TRIGGER_HPDMA3_CH14_TCF (74U) /*!< HPDMA HW Trigger signal is HPDMA3_CH14_TCF */
#define LL_HPDMA_TRIGGER_HPDMA3_CH15_TCF (75U) /*!< HPDMA HW Trigger signal is HPDMA3_CH15_TCF */
#define LL_HPDMA_TRIGGER_TIM2_TRGO       (76U) /*!< HPDMA HW Trigger signal is TIM2_TRGO       */
#define LL_HPDMA_TRIGGER_TIM15_TRGO      (77U) /*!< HPDMA HW Trigger signal is TIM15_TRGO      */
#define LL_HPDMA_TRIGGER_DCMIPP_P2_HSYNC (78U) /*!< HPDMA HW Trigger signal is DCMIPP_P2_HSYNC */
#define LL_HPDMA_TRIGGER_DCMIPP_P2_VSYNC (79U) /*!< HPDMA HW Trigger signal is DCMIPP_P2_VSYNC */
#define LL_HPDMA_TRIGGER_DCMIPP_P2_LEND  (80U) /*!< HPDMA HW Trigger signal is DCMIPP_P2_LEND  */
#define LL_HPDMA_TRIGGER_DCMIPP_P2_FEND  (81U) /*!< HPDMA HW Trigger signal is DCMIPP_P2_FEND  */

/* LPDMA triggers */
#define LL_LPDMA_TRIGGER_EXTI_LINE0      (0U)  /*!< LPDMA HW Trigger signal is EXTI_LINE0      */
#define LL_LPDMA_TRIGGER_EXTI_LINE1      (1U)  /*!< LPDMA HW Trigger signal is EXTI_LINE1      */
#define LL_LPDMA_TRIGGER_EXTI_LINE2      (2U)  /*!< LPDMA HW Trigger signal is EXTI_LINE2      */
#define LL_LPDMA_TRIGGER_EXTI_LINE3      (3U)  /*!< LPDMA HW Trigger signal is EXTI_LINE3      */
#define LL_LPDMA_TRIGGER_EXTI_LINE4      (4U)  /*!< LPDMA HW Trigger signal is EXTI_LINE4      */
#define LL_LPDMA_TRIGGER_TAMP_TRG1       (5U)  /*!< LPDMA HW Trigger signal is TAMP_TRG1       */
#define LL_LPDMA_TRIGGER_TAMP_TRG2       (6U)  /*!< LPDMA HW Trigger signal is TAMP_TRG2       */
#define LL_LPDMA_TRIGGER_TAMP_TRG3       (7U)  /*!< LPDMA HW Trigger signal is TAMP_TRG3       */
#define LL_LPDMA_TRIGGER_LPTIM2_CH1      (8U)  /*!< LPDMA HW Trigger signal is LPTIM2_CH1      */
#define LL_LPDMA_TRIGGER_LPTIM3_CH1      (9U)  /*!< LPDMA HW Trigger signal is LPTIM3_CH1      */
#define LL_LPDMA_TRIGGER_LPTIM4_CH1      (10U) /*!< LPDMA HW Trigger signal is LPTIM4_CH1      */
#define LL_LPDMA_TRIGGER_LPTIM5_CH1      (11U) /*!< LPDMA HW Trigger signal is LPTIM5_CH1      */
#define LL_LPDMA_TRIGGER_RTC_ALRA_TRG    (12U) /*!< LPDMA HW Trigger signal is RTC_ALRA_TRG    */
#define LL_LPDMA_TRIGGER_RTC_ALRB_TRG    (13U) /*!< LPDMA HW Trigger signal is RTC_ALRB_TRG    */
#define LL_LPDMA_TRIGGER_RTC_WUT_TRG     (14U) /*!< LPDMA HW Trigger signal is RTC_WUT_TRG     */
#define LL_LPDMA_TRIGGER_LPDMA_CH0_TCF   (15U) /*!< LPDMA HW Trigger signal is LL_LPDMA_CH0_TCF   */
#define LL_LPDMA_TRIGGER_LPDMA_CH1_TCF   (16U) /*!< LPDMA HW Trigger signal is LL_LPDMA_CH1_TCF   */
#define LL_LPDMA_TRIGGER_LPDMA_CH2_TCF   (17U) /*!< LPDMA HW Trigger signal is LL_LPDMA_CH2_TCF   */
#define LL_LPDMA_TRIGGER_LPDMA_CH3_TCF   (18U) /*!< LPDMA HW Trigger signal is LL_LPDMA_CH3_TCF   */
#define LL_LPDMA_TRIGGER_HPDMA1_CH0_TCF  (19U) /*!< LPDMA HW Trigger signal is HPDMA1_CH0_TCF  */
#define LL_LPDMA_TRIGGER_HPDMA1_CH8_TCF  (20U) /*!< LPDMA HW Trigger signal is HPDMA1_CH8_TCF  */
#define LL_LPDMA_TRIGGER_HPDMA1_CH12_TCF (21U) /*!< LPDMA HW Trigger signal is HPDMA1_CH12_TCF */
#define LL_LPDMA_TRIGGER_HPDMA2_CH0_TCF  (22U) /*!< LPDMA HW Trigger signal is HPDMA2_CH0_TCF  */
#define LL_LPDMA_TRIGGER_HPDMA2_CH8_TCF  (23U) /*!< LPDMA HW Trigger signal is HPDMA2_CH8_TCF  */
#define LL_LPDMA_TRIGGER_HPDMA2_CH12_TCF (24U) /*!< LPDMA HW Trigger signal is HPDMA2_CH12_TCF */
#define LL_LPDMA_TRIGGER_HPDMA3_CH0_TCF  (25U) /*!< LPDMA HW Trigger signal is HPDMA3_CH0_TCF  */
#define LL_LPDMA_TRIGGER_HPDMA3_CH8_TCF  (26U) /*!< LPDMA HW Trigger signal is HPDMA3_CH8_TCF  */
#define LL_LPDMA_TRIGGER_HPDMA3_CH12_TCF (27U) /*!< LPDMA HW Trigger signal is HPDMA3_CH12_TCF */
#define LL_LPDMA_TRIGGER_TIM2_TRGO       (28U) /*!< LPDMA HW Trigger signal is TIM2_TRGO       */
#define LL_LPDMA_TRIGGER_TIM15_TRGO      (29U) /*!< LPDMA HW Trigger signal is TIM15_TRGO      */

#else

#define LL_HPDMA_TRIGGER_EXTI_LINE0      (0U)  /*!< HPDMA HW Trigger signal is EXTI_LINE0      */
#define LL_HPDMA_TRIGGER_EXTI_LINE1      (1U)  /*!< HPDMA HW Trigger signal is EXTI_LINE1      */
#define LL_HPDMA_TRIGGER_EXTI_LINE2      (2U)  /*!< HPDMA HW Trigger signal is EXTI_LINE2      */
#define LL_HPDMA_TRIGGER_EXTI_LINE3      (3U)  /*!< HPDMA HW Trigger signal is EXTI_LINE3      */
#define LL_HPDMA_TRIGGER_EXTI_LINE4      (4U)  /*!< HPDMA HW Trigger signal is EXTI_LINE4      */
#define LL_HPDMA_TRIGGER_EXTI_LINE5      (5U)  /*!< HPDMA HW Trigger signal is EXTI_LINE5      */
#define LL_HPDMA_TRIGGER_EXTI_LINE6      (6U)  /*!< HPDMA HW Trigger signal is EXTI_LINE6      */
#define LL_HPDMA_TRIGGER_EXTI_LINE7      (7U)  /*!< HPDMA HW Trigger signal is EXTI_LINE7      */
#define LL_HPDMA_TRIGGER_EXTI_LINE8      (8U)  /*!< HPDMA HW Trigger signal is EXTI_LINE8      */
#define LL_HPDMA_TRIGGER_EXTI_LINE9      (9U)  /*!< HPDMA HW Trigger signal is EXTI_LINE9      */
#define LL_HPDMA_TRIGGER_EXTI_LINE10     (10U) /*!< HPDMA HW Trigger signal is EXTI_LINE10     */
#define LL_HPDMA_TRIGGER_EXTI_LINE11     (11U) /*!< HPDMA HW Trigger signal is EXTI_LINE11     */
#define LL_HPDMA_TRIGGER_EXTI_LINE12     (12U) /*!< HPDMA HW Trigger signal is EXTI_LINE12     */
#define LL_HPDMA_TRIGGER_EXTI_LINE13     (13U) /*!< HPDMA HW Trigger signal is EXTI_LINE13     */
#define LL_HPDMA_TRIGGER_EXTI_LINE14     (14U) /*!< HPDMA HW Trigger signal is EXTI_LINE14     */
#define LL_HPDMA_TRIGGER_EXTI_LINE15     (15U) /*!< HPDMA HW Trigger signal is EXTI_LINE15     */
#define LL_HPDMA_TRIGGER_LPTIM1_CH1      (16U) /*!< HPDMA HW Trigger signal is LPTIM1_CH1      */
#define LL_HPDMA_TRIGGER_LPTIM2_CH1      (17U) /*!< HPDMA HW Trigger signal is LPTIM2_CH1      */
#define LL_HPDMA_TRIGGER_LPTIM3_CH1      (18U) /*!< HPDMA HW Trigger signal is LPTIM3_CH1      */
#define LL_HPDMA_TRIGGER_LPTIM4_CH1      (19U) /*!< HPDMA HW Trigger signal is LPTIM4_CH1      */
#define LL_HPDMA_TRIGGER_LPTIM5_CH1      (20U) /*!< HPDMA HW Trigger signal is LPTIM5_CH1      */
#define LL_HPDMA_TRIGGER_RTC_ALRA_TRG    (21U) /*!< HPDMA HW Trigger signal is RTC_ALRA_TRG    */
#define LL_HPDMA_TRIGGER_RTC_ALRB_TRG    (22U) /*!< HPDMA HW Trigger signal is RTC_ALRB_TRG    */
#define LL_HPDMA_TRIGGER_RTC_WUT_TRG     (23U) /*!< HPDMA HW Trigger signal is RTC_WUT_TRG     */
#define LL_HPDMA_TRIGGER_HPDMA1_CH0_TCF  (24U) /*!< HPDMA HW Trigger signal is HPDMA1_CH0_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA1_CH1_TCF  (25U) /*!< HPDMA HW Trigger signal is HPDMA1_CH1_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA1_CH2_TCF  (26U) /*!< HPDMA HW Trigger signal is HPDMA1_CH2_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA1_CH3_TCF  (27U) /*!< HPDMA HW Trigger signal is HPDMA1_CH3_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA1_CH4_TCF  (28U) /*!< HPDMA HW Trigger signal is HPDMA1_CH4_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA1_CH5_TCF  (29U) /*!< HPDMA HW Trigger signal is HPDMA1_CH5_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA1_CH6_TCF  (30U) /*!< HPDMA HW Trigger signal is HPDMA1_CH6_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA1_CH7_TCF  (31U) /*!< HPDMA HW Trigger signal is HPDMA1_CH7_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA1_CH8_TCF  (32U) /*!< HPDMA HW Trigger signal is HPDMA1_CH8_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA1_CH9_TCF  (33U) /*!< HPDMA HW Trigger signal is HPDMA1_CH9_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA1_CH10_TCF (34U) /*!< HPDMA HW Trigger signal is HPDMA1_CH10_TCF */
#define LL_HPDMA_TRIGGER_HPDMA1_CH11_TCF (35U) /*!< HPDMA HW Trigger signal is HPDMA1_CH11_TCF */
#define LL_HPDMA_TRIGGER_HPDMA1_CH12_TCF (36U) /*!< HPDMA HW Trigger signal is HPDMA1_CH12_TCF */
#define LL_HPDMA_TRIGGER_HPDMA1_CH13_TCF (37U) /*!< HPDMA HW Trigger signal is HPDMA1_CH13_TCF */
#define LL_HPDMA_TRIGGER_HPDMA1_CH14_TCF (38U) /*!< HPDMA HW Trigger signal is HPDMA1_CH14_TCF */
#define LL_HPDMA_TRIGGER_HPDMA1_CH15_TCF (39U) /*!< HPDMA HW Trigger signal is HPDMA1_CH15_TCF */
#define LL_HPDMA_TRIGGER_HPDMA2_CH0_TCF  (40U) /*!< HPDMA HW Trigger signal is HPDMA2_CH0_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA2_CH1_TCF  (41U) /*!< HPDMA HW Trigger signal is HPDMA2_CH1_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA2_CH2_TCF  (42U) /*!< HPDMA HW Trigger signal is HPDMA2_CH2_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA2_CH3_TCF  (43U) /*!< HPDMA HW Trigger signal is HPDMA2_CH3_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA2_CH4_TCF  (44U) /*!< HPDMA HW Trigger signal is HPDMA2_CH4_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA2_CH5_TCF  (45U) /*!< HPDMA HW Trigger signal is HPDMA2_CH5_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA2_CH6_TCF  (46U) /*!< HPDMA HW Trigger signal is HPDMA2_CH6_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA2_CH7_TCF  (47U) /*!< HPDMA HW Trigger signal is HPDMA2_CH7_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA2_CH8_TCF  (48U) /*!< HPDMA HW Trigger signal is HPDMA2_CH8_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA2_CH9_TCF  (49U) /*!< HPDMA HW Trigger signal is HPDMA2_CH9_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA2_CH10_TCF (50U) /*!< HPDMA HW Trigger signal is HPDMA2_CH10_TCF */
#define LL_HPDMA_TRIGGER_HPDMA2_CH11_TCF (51U) /*!< HPDMA HW Trigger signal is HPDMA2_CH11_TCF */
#define LL_HPDMA_TRIGGER_HPDMA2_CH12_TCF (52U) /*!< HPDMA HW Trigger signal is HPDMA2_CH12_TCF */
#define LL_HPDMA_TRIGGER_HPDMA2_CH13_TCF (53U) /*!< HPDMA HW Trigger signal is HPDMA2_CH13_TCF */
#define LL_HPDMA_TRIGGER_HPDMA2_CH14_TCF (54U) /*!< HPDMA HW Trigger signal is HPDMA2_CH14_TCF */
#define LL_HPDMA_TRIGGER_HPDMA2_CH15_TCF (55U) /*!< HPDMA HW Trigger signal is HPDMA2_CH15_TCF */
#define LL_HPDMA_TRIGGER_HPDMA3_CH0_TCF  (56U) /*!< HPDMA HW Trigger signal is HPDMA3_CH0_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA3_CH1_TCF  (57U) /*!< HPDMA HW Trigger signal is HPDMA3_CH1_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA3_CH2_TCF  (58U) /*!< HPDMA HW Trigger signal is HPDMA3_CH2_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA3_CH3_TCF  (59U) /*!< HPDMA HW Trigger signal is HPDMA3_CH3_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA3_CH4_TCF  (60U) /*!< HPDMA HW Trigger signal is HPDMA3_CH4_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA3_CH5_TCF  (61U) /*!< HPDMA HW Trigger signal is HPDMA3_CH5_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA3_CH6_TCF  (62U) /*!< HPDMA HW Trigger signal is HPDMA3_CH6_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA3_CH7_TCF  (63U) /*!< HPDMA HW Trigger signal is HPDMA3_CH7_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA3_CH8_TCF  (64U) /*!< HPDMA HW Trigger signal is HPDMA3_CH8_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA3_CH9_TCF  (65U) /*!< HPDMA HW Trigger signal is HPDMA3_CH9_TCF  */
#define LL_HPDMA_TRIGGER_HPDMA3_CH10_TCF (66U) /*!< HPDMA HW Trigger signal is HPDMA3_CH10_TCF */
#define LL_HPDMA_TRIGGER_HPDMA3_CH11_TCF (67U) /*!< HPDMA HW Trigger signal is HPDMA3_CH11_TCF */
#define LL_HPDMA_TRIGGER_HPDMA3_CH12_TCF (68U) /*!< HPDMA HW Trigger signal is HPDMA3_CH12_TCF */
#define LL_HPDMA_TRIGGER_HPDMA3_CH13_TCF (69U) /*!< HPDMA HW Trigger signal is HPDMA3_CH13_TCF */
#define LL_HPDMA_TRIGGER_HPDMA3_CH14_TCF (70U) /*!< HPDMA HW Trigger signal is HPDMA3_CH14_TCF */
#define LL_HPDMA_TRIGGER_HPDMA3_CH15_TCF (71U) /*!< HPDMA HW Trigger signal is HPDMA3_CH15_TCF */
#define LL_HPDMA_TRIGGER_TIM2_TRGO       (72U) /*!< HPDMA HW Trigger signal is TIM2_TRGO       */
#define LL_HPDMA_TRIGGER_TIM15_TRGO      (73U) /*!< HPDMA HW Trigger signal is TIM15_TRGO      */
#define LL_HPDMA_TRIGGER_DCMIPP_P2_HSYNC (74U) /*!< HPDMA HW Trigger signal is DCMIPP_P2_HSYNC */
#define LL_HPDMA_TRIGGER_DCMIPP_P2_VSYNC (75U) /*!< HPDMA HW Trigger signal is DCMIPP_P2_VSYNC */
#define LL_HPDMA_TRIGGER_DCMIPP_P2_LEND  (76U) /*!< HPDMA HW Trigger signal is DCMIPP_P2_LEND  */
#define LL_HPDMA_TRIGGER_DCMIPP_P2_FEND  (77U) /*!< HPDMA HW Trigger signal is DCMIPP_P2_FEND  */

#endif /* LPDMA */
/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/

/** @defgroup DMA_LL_Exported_Macros DMA Exported Macros
  * @{
  */

/** @defgroup DMA_LL_EM_COMMON_WRITE_READ_REGISTERS Common Write and Read Registers macros
  * @{
  */
/**
  * @brief  Write a value in DMA register.
  * @param  __INSTANCE__ DMA Instance.
  * @param  __REG__      Register to be written.
  * @param  __VALUE__    Value to be written in the register.
  * @retval None.
  */
#define LL_DMA_WriteReg(__INSTANCE__, __REG__, __VALUE__) WRITE_REG((__INSTANCE__)->__REG__, (__VALUE__))

/**
  * @brief  Read a value in DMA register.
  * @param  __INSTANCE__ DMA Instance.
  * @param  __REG__      Register to be read.
  * @retval Register value.
  */
#define LL_DMA_ReadReg(__INSTANCE__, __REG__) READ_REG(__INSTANCE__->__REG__)
/**
  * @}
  */

/** @defgroup DMA_LL_EM_CONVERT_DMAxCHANNELy Convert DMAxChannely
  * @{
  */
/**
  * @brief  Convert DMAx_Channely into DMAx.
  * @param  __CHANNEL_INSTANCE__ DMAx_Channely.
  * @retval DMAx.
  */
#if  defined(LPDMA)
#define LL_DMA_GET_INSTANCE(__CHANNEL_INSTANCE__) \
  ((((uint32_t)(__CHANNEL_INSTANCE__) < ((uint32_t)HPDMA2_Channel0))) \
   ? HPDMA1 :                                                         \
   (((uint32_t)(__CHANNEL_INSTANCE__) < ((uint32_t)HPDMA3_Channel0))) \
   ? HPDMA2 :                                                         \
   (((uint32_t)(__CHANNEL_INSTANCE__) < ((uint32_t)LPDMA_Channel0)))  \
   ? HPDMA3 : LPDMA)
#else
#define LL_DMA_GET_INSTANCE(__CHANNEL_INSTANCE__) \
  ((((uint32_t)(__CHANNEL_INSTANCE__) < ((uint32_t)HPDMA2_Channel0))) \
   ? HPDMA1 :                                                         \
   (((uint32_t)(__CHANNEL_INSTANCE__) < ((uint32_t)HPDMA3_Channel0))) \
   ? HPDMA2 : HPDMA3)
#endif /* LPDMA */


