zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_dma.h
/**
  * @brief Set hardware request.
  * @note  This API is used for all available DMA channels.
  *        For LPDMA channels, REQSEL fields is reduced to 5 bits.
  * @rmtoll CTR2         REQSEL     LL_DMA_SetPeriphRequest
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_0
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  *         @arg @ref LL_DMA_CHANNEL_7
  *         @arg @ref LL_DMA_CHANNEL_8
  *         @arg @ref LL_DMA_CHANNEL_9
  *         @arg @ref LL_DMA_CHANNEL_10
  *         @arg @ref LL_DMA_CHANNEL_11
  *         @arg @ref LL_DMA_CHANNEL_12
  *         @arg @ref LL_DMA_CHANNEL_13
  *         @arg @ref LL_DMA_CHANNEL_14
  *         @arg @ref LL_DMA_CHANNEL_15
  * @param  Request This parameter can be one of the following values:
  *         @arg @ref LL_HPDMA_REQUEST_FMC_TXRX
  *         @arg @ref LL_HPDMA_REQUEST_FMC_BCH
  *         @arg @ref LL_HPDMA_REQUEST_OCTOSPI1
  *         @arg @ref LL_HPDMA_REQUEST_OCTOSPI2
  *         @arg @ref LL_HPDMA_REQUEST_CRYP1_IN
  *         @arg @ref LL_HPDMA_REQUEST_CRYP1_OUT
  *         @arg @ref LL_HPDMA_REQUEST_HASH
  *         @arg @ref LL_HPDMA_REQUEST_SAES_OUT
  *         @arg @ref LL_HPDMA_REQUEST_SAES_IN
  *         @arg @ref LL_HPDMA_REQUEST_USART1_RX
  *         @arg @ref LL_HPDMA_REQUEST_USART1_TX
  *         @arg @ref LL_HPDMA_REQUEST_USART2_RX
  *         @arg @ref LL_HPDMA_REQUEST_USART2_TX
  *         @arg @ref LL_HPDMA_REQUEST_USART3_RX
  *         @arg @ref LL_HPDMA_REQUEST_USART3_TX
  *         @arg @ref LL_HPDMA_REQUEST_UART4_RX
  *         @arg @ref LL_HPDMA_REQUEST_UART4_TX
  *         @arg @ref LL_HPDMA_REQUEST_UART5_RX
  *         @arg @ref LL_HPDMA_REQUEST_UART5_TX
  *         @arg @ref LL_HPDMA_REQUEST_USART6_RX
  *         @arg @ref LL_HPDMA_REQUEST_USART6_TX
  *         @arg @ref LL_HPDMA_REQUEST_UART7_RX
  *         @arg @ref LL_HPDMA_REQUEST_UART7_TX
  *         @arg @ref LL_HPDMA_REQUEST_UART8_RX
  *         @arg @ref LL_HPDMA_REQUEST_UART8_TX
  *         @arg @ref LL_HPDMA_REQUEST_UART9_RX
  *         @arg @ref LL_HPDMA_REQUEST_UART9_TX
  *         @arg @ref LL_HPDMA_REQUEST_I2C1_RX
  *         @arg @ref LL_HPDMA_REQUEST_I2C1_TX
  *         @arg @ref LL_HPDMA_REQUEST_I2C1_EVC
  *         @arg @ref LL_HPDMA_REQUEST_I2C2_RX
  *         @arg @ref LL_HPDMA_REQUEST_I2C2_TX
  *         @arg @ref LL_HPDMA_REQUEST_I2C2_EVC
  *         @arg @ref LL_HPDMA_REQUEST_I2C3_RX
  *         @arg @ref LL_HPDMA_REQUEST_I2C3_TX
  *         @arg @ref LL_HPDMA_REQUEST_I2C3_EVC
  *         @arg @ref LL_HPDMA_REQUEST_I2C4_RX
  *         @arg @ref LL_HPDMA_REQUEST_I2C4_TX
  *         @arg @ref LL_HPDMA_REQUEST_I2C4_EVC
  *         @arg @ref LL_HPDMA_REQUEST_I2C5_RX
  *         @arg @ref LL_HPDMA_REQUEST_I2C5_TX
  *         @arg @ref LL_HPDMA_REQUEST_I2C5_EVC
  *         @arg @ref LL_HPDMA_REQUEST_I2C6_RX
  *         @arg @ref LL_HPDMA_REQUEST_I2C6_TX
  *         @arg @ref LL_HPDMA_REQUEST_I2C6_EVC
  *         @arg @ref LL_HPDMA_REQUEST_I2C7_RX
  *         @arg @ref LL_HPDMA_REQUEST_I2C7_TX
  *         @arg @ref LL_HPDMA_REQUEST_I2C7_EVC
  *         @arg @ref LL_HPDMA_REQUEST_RESERVED48
  *         @arg @ref LL_HPDMA_REQUEST_SPI1_RX
  *         @arg @ref LL_HPDMA_REQUEST_SPI1_TX
  *         @arg @ref LL_HPDMA_REQUEST_SPI2_RX
  *         @arg @ref LL_HPDMA_REQUEST_SPI2_TX
  *         @arg @ref LL_HPDMA_REQUEST_SPI3_RX
  *         @arg @ref LL_HPDMA_REQUEST_SPI3_TX
  *         @arg @ref LL_HPDMA_REQUEST_SPI4_RX
  *         @arg @ref LL_HPDMA_REQUEST_SPI4_TX
  *         @arg @ref LL_HPDMA_REQUEST_SPI5_RX
  *         @arg @ref LL_HPDMA_REQUEST_SPI5_TX
  *         @arg @ref LL_HPDMA_REQUEST_SPI6_RX
  *         @arg @ref LL_HPDMA_REQUEST_SPI6_TX
  *         @arg @ref LL_HPDMA_REQUEST_SPI7_RX
  *         @arg @ref LL_HPDMA_REQUEST_SPI7_TX
  *         @arg @ref LL_HPDMA_REQUEST_MDF1_FLT0
  *         @arg @ref LL_HPDMA_REQUEST_MDF1_FLT1
  *         @arg @ref LL_HPDMA_REQUEST_MDF1_FLT2
  *         @arg @ref LL_HPDMA_REQUEST_MDF1_FLT3
  *         @arg @ref LL_HPDMA_REQUEST_MDF1_FLT4
  *         @arg @ref LL_HPDMA_REQUEST_MDF1_FLT5
  *         @arg @ref LL_HPDMA_REQUEST_MDF1_FLT6
  *         @arg @ref LL_HPDMA_REQUEST_MDF1_FLT7
  *         @arg @ref LL_HPDMA_REQUEST_SPDIFRX_DT
  *         @arg @ref LL_HPDMA_REQUEST_SPDIFRX_CS
  *         @arg @ref LL_HPDMA_REQUEST_SAI1_A
  *         @arg @ref LL_HPDMA_REQUEST_SAI1_B
  *         @arg @ref LL_HPDMA_REQUEST_SAI2_A
  *         @arg @ref LL_HPDMA_REQUEST_SAI2_B
  *         @arg @ref LL_HPDMA_REQUEST_SAI3_A
  *         @arg @ref LL_HPDMA_REQUEST_SAI3_B
  *         @arg @ref LL_HPDMA_REQUEST_SAI4_A
  *         @arg @ref LL_HPDMA_REQUEST_SAI4_B
  *         @arg @ref LL_HPDMA_REQUEST_ADC1
  *         @arg @ref LL_HPDMA_REQUEST_ADC2
  *         @arg @ref LL_HPDMA_REQUEST_ADC3
  *         @arg @ref LL_HPDMA_REQUEST_TIM1_CH1
  *         @arg @ref LL_HPDMA_REQUEST_TIM1_CH2
  *         @arg @ref LL_HPDMA_REQUEST_TIM1_CH3
  *         @arg @ref LL_HPDMA_REQUEST_TIM1_CH4
  *         @arg @ref LL_HPDMA_REQUEST_TIM1_UP
  *         @arg @ref LL_HPDMA_REQUEST_TIM1_TRIG
  *         @arg @ref LL_HPDMA_REQUEST_TIM1_COM
  *         @arg @ref LL_HPDMA_REQUEST_TIM2_CH1
  *         @arg @ref LL_HPDMA_REQUEST_TIM2_CH2
  *         @arg @ref LL_HPDMA_REQUEST_TIM2_CH3
  *         @arg @ref LL_HPDMA_REQUEST_TIM2_CH4
  *         @arg @ref LL_HPDMA_REQUEST_TIM2_UP
  *         @arg @ref LL_HPDMA_REQUEST_TIM3_CH1
  *         @arg @ref LL_HPDMA_REQUEST_TIM3_CH2
  *         @arg @ref LL_HPDMA_REQUEST_TIM3_CH3
  *         @arg @ref LL_HPDMA_REQUEST_TIM3_CH4
  *         @arg @ref LL_HPDMA_REQUEST_TIM3_UP
  *         @arg @ref LL_HPDMA_REQUEST_TIM3_TRIG
  *         @arg @ref LL_HPDMA_REQUEST_TIM4_CH1
  *         @arg @ref LL_HPDMA_REQUEST_TIM4_CH2
  *         @arg @ref LL_HPDMA_REQUEST_TIM4_CH3
  *         @arg @ref LL_HPDMA_REQUEST_TIM4_UP
  *         @arg @ref LL_HPDMA_REQUEST_TIM5_CH1
  *         @arg @ref LL_HPDMA_REQUEST_TIM5_CH2
  *         @arg @ref LL_HPDMA_REQUEST_TIM5_CH3
  *         @arg @ref LL_HPDMA_REQUEST_TIM5_CH4
  *         @arg @ref LL_HPDMA_REQUEST_TIM5_UP
  *         @arg @ref LL_HPDMA_REQUEST_TIM5_TRIG
  *         @arg @ref LL_HPDMA_REQUEST_TIM6_UP
  *         @arg @ref LL_HPDMA_REQUEST_TIM7_UP
  *         @arg @ref LL_HPDMA_REQUEST_TIM8_CH1
  *         @arg @ref LL_HPDMA_REQUEST_TIM8_CH2
  *         @arg @ref LL_HPDMA_REQUEST_TIM8_CH3
  *         @arg @ref LL_HPDMA_REQUEST_TIM8_CH4
  *         @arg @ref LL_HPDMA_REQUEST_TIM8_UP
  *         @arg @ref LL_HPDMA_REQUEST_TIM8_TRIG
  *         @arg @ref LL_HPDMA_REQUEST_TIM8_COM
  *         @arg @ref LL_HPDMA_REQUEST_TIM15_CH1
  *         @arg @ref LL_HPDMA_REQUEST_TIM15_UP
  *         @arg @ref LL_HPDMA_REQUEST_TIM15_TRIG
  *         @arg @ref LL_HPDMA_REQUEST_TIM15_COM
  *         @arg @ref LL_HPDMA_REQUEST_TIM16_CH1
  *         @arg @ref LL_HPDMA_REQUEST_TIM16_UP
  *         @arg @ref LL_HPDMA_REQUEST_TIM17_CH1
  *         @arg @ref LL_HPDMA_REQUEST_TIM17_UP
  *         @arg @ref LL_HPDMA_REQUEST_TIM20_CH1
  *         @arg @ref LL_HPDMA_REQUEST_TIM20_CH2
  *         @arg @ref LL_HPDMA_REQUEST_TIM20_CH3
  *         @arg @ref LL_HPDMA_REQUEST_TIM20_CH4
  *         @arg @ref LL_HPDMA_REQUEST_TIM20_UP
  *         @arg @ref LL_HPDMA_REQUEST_TIM20_TRIG
  *         @arg @ref LL_HPDMA_REQUEST_TIM20_COM
  *         @arg @ref LL_HPDMA_REQUEST_PCIE
  *         @arg @ref LL_HPDMA_REQUEST_DCMI
  *         @arg @ref LL_HPDMA_REQUEST_UCPD_TX
  *         @arg @ref LL_HPDMA_REQUEST_UCPD_RX
  *         @arg @ref LL_HPDMA_REQUEST_CRYP2_IN
  *         @arg @ref LL_HPDMA_REQUEST_CRYP2_OUT
  *         @arg @ref LL_HPDMA_REQUEST_TIM4_CH4
  *         @arg @ref LL_HPDMA_REQUEST_LPTIM1_IC1
  *         @arg @ref LL_HPDMA_REQUEST_LPTIM1_IC2
  *         @arg @ref LL_HPDMA_REQUEST_LPTIM1_UE
  *         @arg @ref LL_HPDMA_REQUEST_LPTIM2_IC1
  *         @arg @ref LL_HPDMA_REQUEST_LPTIM2_IC2
  *         @arg @ref LL_HPDMA_REQUEST_LPTIM2_UE
  *         @arg @ref LL_HPDMA_REQUEST_TIM2_TRIG
  *         @arg @ref LL_HPDMA_REQUEST_TIM4_TRIG
  *         @arg @ref LL_HPDMA_REQUEST_TIM15_CH2
  *         @arg @ref LL_HPDMA_REQUEST_TIM16_COM
  *         @arg @ref LL_HPDMA_REQUEST_TIM17_COM
  *         @arg @ref LL_HPDMA_REQUEST_I3C1_RX
  *         @arg @ref LL_HPDMA_REQUEST_I3C1_TX
  *         @arg @ref LL_HPDMA_REQUEST_I3C1_CMD
  *         @arg @ref LL_HPDMA_REQUEST_I3C1_STAT
  *         @arg @ref LL_HPDMA_REQUEST_I3C2_RX
  *         @arg @ref LL_HPDMA_REQUEST_I3C2_TX
  *         @arg @ref LL_HPDMA_REQUEST_I3C2_CMD
  *         @arg @ref LL_HPDMA_REQUEST_I3C2_STAT
  *         @arg @ref LL_HPDMA_REQUEST_I3C3_RX
  *         @arg @ref LL_HPDMA_REQUEST_I3C3_TX
  *         @arg @ref LL_HPDMA_REQUEST_I3C3_CMD
  *         @arg @ref LL_HPDMA_REQUEST_I3C3_STAT
  *
  *         @arg @ref LL_LPDMA_REQUEST_LPUART1_RX
  *         @arg @ref LL_LPDMA_REQUEST_LPUART1_TX
  *         @arg @ref LL_LPDMA_REQUEST_I2C8_RX
  *         @arg @ref LL_LPDMA_REQUEST_I2C8_TX
  *         @arg @ref LL_LPDMA_REQUEST_I2C8_EVC
  *         @arg @ref LL_LPDMA_REQUEST_SPI8_RX
  *         @arg @ref LL_LPDMA_REQUEST_SPI8_TX
  *         @arg @ref LL_LPDMA_REQUEST_ADF1_FLT0
  *         @arg @ref LL_LPDMA_REQUEST_LPTIM3_IC1
  *         @arg @ref LL_LPDMA_REQUEST_LPTIM3_IC2
  *         @arg @ref LL_LPDMA_REQUEST_LPTIM3_UE
  *         @arg @ref LL_LPDMA_REQUEST_LPTIM4_IC1
  *         @arg @ref LL_LPDMA_REQUEST_LPTIM4_IC2
  *         @arg @ref LL_LPDMA_REQUEST_LPTIM4_UE
  *         @arg @ref LL_LPDMA_REQUEST_I3C4_RX
  *         @arg @ref LL_LPDMA_REQUEST_I3C4_TX
  *         @arg @ref LL_LPDMA_REQUEST_I3C4_CMD
  *         @arg @ref LL_LPDMA_REQUEST_I3C4_STAT
  * @retval None.
  */
__STATIC_INLINE void LL_DMA_SetPeriphRequest(const DMA_TypeDef *DMAx, uint32_t Channel, uint32_t Request)
{
  uint32_t dma_base_addr = (uint32_t)DMAx;
  MODIFY_REG(((DMA_Channel_TypeDef *)(dma_base_addr + LL_DMA_CH_OFFSET_TAB[Channel]))->CTR2, DMA_CTR2_REQSEL, Request);
}

/**
  * @brief  Get hardware request.
  * @note  This API is used for all available DMA channels.
  *        For LPDMA channels, REQSEL fields is reduced to 5 bits.
  * @rmtoll CTR2         REQSEL     LL_DMA_GetPeriphRequest
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_0
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  *         @arg @ref LL_DMA_CHANNEL_7
  *         @arg @ref LL_DMA_CHANNEL_8
  *         @arg @ref LL_DMA_CHANNEL_9
  *         @arg @ref LL_DMA_CHANNEL_10
  *         @arg @ref LL_DMA_CHANNEL_11
  *         @arg @ref LL_DMA_CHANNEL_12
  *         @arg @ref LL_DMA_CHANNEL_13
  *         @arg @ref LL_DMA_CHANNEL_14
  *         @arg @ref LL_DMA_CHANNEL_15
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_HPDMA_REQUEST_FMC_TXRX
  *         @arg @ref LL_HPDMA_REQUEST_FMC_BCH
  *         @arg @ref LL_HPDMA_REQUEST_OCTOSPI1
  *         @arg @ref LL_HPDMA_REQUEST_OCTOSPI2
  *         @arg @ref LL_HPDMA_REQUEST_CRYP1_IN
  *         @arg @ref LL_HPDMA_REQUEST_CRYP1_OUT
  *         @arg @ref LL_HPDMA_REQUEST_HASH
  *         @arg @ref LL_HPDMA_REQUEST_SAES_OUT
  *         @arg @ref LL_HPDMA_REQUEST_SAES_IN
  *         @arg @ref LL_HPDMA_REQUEST_USART1_RX
  *         @arg @ref LL_HPDMA_REQUEST_USART1_TX
  *         @arg @ref LL_HPDMA_REQUEST_USART2_RX
  *         @arg @ref LL_HPDMA_REQUEST_USART2_TX
  *         @arg @ref LL_HPDMA_REQUEST_USART3_RX
  *         @arg @ref LL_HPDMA_REQUEST_USART3_TX
  *         @arg @ref LL_HPDMA_REQUEST_UART4_RX
  *         @arg @ref LL_HPDMA_REQUEST_UART4_TX
  *         @arg @ref LL_HPDMA_REQUEST_UART5_RX
  *         @arg @ref LL_HPDMA_REQUEST_UART5_TX
  *         @arg @ref LL_HPDMA_REQUEST_USART6_RX
  *         @arg @ref LL_HPDMA_REQUEST_USART6_TX
  *         @arg @ref LL_HPDMA_REQUEST_UART7_RX
  *         @arg @ref LL_HPDMA_REQUEST_UART7_TX
  *         @arg @ref LL_HPDMA_REQUEST_UART8_RX
  *         @arg @ref LL_HPDMA_REQUEST_UART8_TX
  *         @arg @ref LL_HPDMA_REQUEST_UART9_RX
  *         @arg @ref LL_HPDMA_REQUEST_UART9_TX
  *         @arg @ref LL_HPDMA_REQUEST_I2C1_RX
  *         @arg @ref LL_HPDMA_REQUEST_I2C1_TX
  *         @arg @ref LL_HPDMA_REQUEST_I2C1_EVC
  *         @arg @ref LL_HPDMA_REQUEST_I2C2_RX
  *         @arg @ref LL_HPDMA_REQUEST_I2C2_TX
  *         @arg @ref LL_HPDMA_REQUEST_I2C2_EVC
  *         @arg @ref LL_HPDMA_REQUEST_I2C3_RX
  *         @arg @ref LL_HPDMA_REQUEST_I2C3_TX
  *         @arg @ref LL_HPDMA_REQUEST_I2C3_EVC
  *         @arg @ref LL_HPDMA_REQUEST_I2C4_RX
  *         @arg @ref LL_HPDMA_REQUEST_I2C4_TX
  *         @arg @ref LL_HPDMA_REQUEST_I2C4_EVC
  *         @arg @ref LL_HPDMA_REQUEST_I2C5_RX
  *         @arg @ref LL_HPDMA_REQUEST_I2C5_TX
  *         @arg @ref LL_HPDMA_REQUEST_I2C5_EVC
  *         @arg @ref LL_HPDMA_REQUEST_I2C6_RX
  *         @arg @ref LL_HPDMA_REQUEST_I2C6_TX
  *         @arg @ref LL_HPDMA_REQUEST_I2C6_EVC
  *         @arg @ref LL_HPDMA_REQUEST_I2C7_RX
  *         @arg @ref LL_HPDMA_REQUEST_I2C7_TX
  *         @arg @ref LL_HPDMA_REQUEST_I2C7_EVC
  *         @arg @ref LL_HPDMA_REQUEST_RESERVED48
  *         @arg @ref LL_HPDMA_REQUEST_SPI1_RX
  *         @arg @ref LL_HPDMA_REQUEST_SPI1_TX
  *         @arg @ref LL_HPDMA_REQUEST_SPI2_RX
  *         @arg @ref LL_HPDMA_REQUEST_SPI2_TX
  *         @arg @ref LL_HPDMA_REQUEST_SPI3_RX
  *         @arg @ref LL_HPDMA_REQUEST_SPI3_TX
  *         @arg @ref LL_HPDMA_REQUEST_SPI4_RX
  *         @arg @ref LL_HPDMA_REQUEST_SPI4_TX
  *         @arg @ref LL_HPDMA_REQUEST_SPI5_RX
  *         @arg @ref LL_HPDMA_REQUEST_SPI5_TX
  *         @arg @ref LL_HPDMA_REQUEST_SPI6_RX
  *         @arg @ref LL_HPDMA_REQUEST_SPI6_TX
  *         @arg @ref LL_HPDMA_REQUEST_SPI7_RX
  *         @arg @ref LL_HPDMA_REQUEST_SPI7_TX
  *         @arg @ref LL_HPDMA_REQUEST_MDF1_FLT0
  *         @arg @ref LL_HPDMA_REQUEST_MDF1_FLT1
  *         @arg @ref LL_HPDMA_REQUEST_MDF1_FLT2
  *         @arg @ref LL_HPDMA_REQUEST_MDF1_FLT3
  *         @arg @ref LL_HPDMA_REQUEST_MDF1_FLT4
  *         @arg @ref LL_HPDMA_REQUEST_MDF1_FLT5
  *         @arg @ref LL_HPDMA_REQUEST_MDF1_FLT6
  *         @arg @ref LL_HPDMA_REQUEST_MDF1_FLT7
  *         @arg @ref LL_HPDMA_REQUEST_SPDIFRX_DT
  *         @arg @ref LL_HPDMA_REQUEST_SPDIFRX_CS
  *         @arg @ref LL_HPDMA_REQUEST_SAI1_A
  *         @arg @ref LL_HPDMA_REQUEST_SAI1_B
  *         @arg @ref LL_HPDMA_REQUEST_SAI2_A
  *         @arg @ref LL_HPDMA_REQUEST_SAI2_B
  *         @arg @ref LL_HPDMA_REQUEST_SAI3_A
  *         @arg @ref LL_HPDMA_REQUEST_SAI3_B
  *         @arg @ref LL_HPDMA_REQUEST_SAI4_A
  *         @arg @ref LL_HPDMA_REQUEST_SAI4_B
  *         @arg @ref LL_HPDMA_REQUEST_ADC1
  *         @arg @ref LL_HPDMA_REQUEST_ADC2
  *         @arg @ref LL_HPDMA_REQUEST_ADC3
  *         @arg @ref LL_HPDMA_REQUEST_TIM1_CH1
  *         @arg @ref LL_HPDMA_REQUEST_TIM1_CH2
  *         @arg @ref LL_HPDMA_REQUEST_TIM1_CH3
  *         @arg @ref LL_HPDMA_REQUEST_TIM1_CH4
  *         @arg @ref LL_HPDMA_REQUEST_TIM1_UP
  *         @arg @ref LL_HPDMA_REQUEST_TIM1_TRIG
  *         @arg @ref LL_HPDMA_REQUEST_TIM1_COM
  *         @arg @ref LL_HPDMA_REQUEST_TIM2_CH1
  *         @arg @ref LL_HPDMA_REQUEST_TIM2_CH2
  *         @arg @ref LL_HPDMA_REQUEST_TIM2_CH3
  *         @arg @ref LL_HPDMA_REQUEST_TIM2_CH4
  *         @arg @ref LL_HPDMA_REQUEST_TIM2_UP
  *         @arg @ref LL_HPDMA_REQUEST_TIM3_CH1
  *         @arg @ref LL_HPDMA_REQUEST_TIM3_CH2
  *         @arg @ref LL_HPDMA_REQUEST_TIM3_CH3
  *         @arg @ref LL_HPDMA_REQUEST_TIM3_CH4
  *         @arg @ref LL_HPDMA_REQUEST_TIM3_UP
  *         @arg @ref LL_HPDMA_REQUEST_TIM3_TRIG
  *         @arg @ref LL_HPDMA_REQUEST_TIM4_CH1
  *         @arg @ref LL_HPDMA_REQUEST_TIM4_CH2
  *         @arg @ref LL_HPDMA_REQUEST_TIM4_CH3
  *         @arg @ref LL_HPDMA_REQUEST_TIM4_UP
  *         @arg @ref LL_HPDMA_REQUEST_TIM5_CH1
  *         @arg @ref LL_HPDMA_REQUEST_TIM5_CH2
  *         @arg @ref LL_HPDMA_REQUEST_TIM5_CH3
  *         @arg @ref LL_HPDMA_REQUEST_TIM5_CH4
  *         @arg @ref LL_HPDMA_REQUEST_TIM5_UP
  *         @arg @ref LL_HPDMA_REQUEST_TIM5_TRIG
  *         @arg @ref LL_HPDMA_REQUEST_TIM6_UP
  *         @arg @ref LL_HPDMA_REQUEST_TIM7_UP
  *         @arg @ref LL_HPDMA_REQUEST_TIM8_CH1
  *         @arg @ref LL_HPDMA_REQUEST_TIM8_CH2
  *         @arg @ref LL_HPDMA_REQUEST_TIM8_CH3
  *         @arg @ref LL_HPDMA_REQUEST_TIM8_CH4
  *         @arg @ref LL_HPDMA_REQUEST_TIM8_UP
  *         @arg @ref LL_HPDMA_REQUEST_TIM8_TRIG
  *         @arg @ref LL_HPDMA_REQUEST_TIM8_COM
  *         @arg @ref LL_HPDMA_REQUEST_TIM15_CH1
  *         @arg @ref LL_HPDMA_REQUEST_TIM15_UP
  *         @arg @ref LL_HPDMA_REQUEST_TIM15_TRIG
  *         @arg @ref LL_HPDMA_REQUEST_TIM15_COM
  *         @arg @ref LL_HPDMA_REQUEST_TIM16_CH1
  *         @arg @ref LL_HPDMA_REQUEST_TIM16_UP
  *         @arg @ref LL_HPDMA_REQUEST_TIM17_CH1
  *         @arg @ref LL_HPDMA_REQUEST_TIM17_UP
  *         @arg @ref LL_HPDMA_REQUEST_TIM20_CH1
  *         @arg @ref LL_HPDMA_REQUEST_TIM20_CH2
  *         @arg @ref LL_HPDMA_REQUEST_TIM20_CH3
  *         @arg @ref LL_HPDMA_REQUEST_TIM20_CH4
  *         @arg @ref LL_HPDMA_REQUEST_TIM20_UP
  *         @arg @ref LL_HPDMA_REQUEST_TIM20_TRIG
  *         @arg @ref LL_HPDMA_REQUEST_TIM20_COM
  *         @arg @ref LL_HPDMA_REQUEST_PCIE
  *         @arg @ref LL_HPDMA_REQUEST_DCMI
  *         @arg @ref LL_HPDMA_REQUEST_UCPD_TX
  *         @arg @ref LL_HPDMA_REQUEST_UCPD_RX
  *         @arg @ref LL_HPDMA_REQUEST_CRYP2_IN
  *         @arg @ref LL_HPDMA_REQUEST_CRYP2_OUT
  *         @arg @ref LL_HPDMA_REQUEST_TIM4_CH4
  *         @arg @ref LL_HPDMA_REQUEST_LPTIM1_IC1
  *         @arg @ref LL_HPDMA_REQUEST_LPTIM1_IC2
  *         @arg @ref LL_HPDMA_REQUEST_LPTIM1_UE
  *         @arg @ref LL_HPDMA_REQUEST_LPTIM2_IC1
  *         @arg @ref LL_HPDMA_REQUEST_LPTIM2_IC2
  *         @arg @ref LL_HPDMA_REQUEST_LPTIM2_UE
  *         @arg @ref LL_HPDMA_REQUEST_TIM2_TRIG
  *         @arg @ref LL_HPDMA_REQUEST_TIM4_TRIG
  *         @arg @ref LL_HPDMA_REQUEST_TIM15_CH2
  *         @arg @ref LL_HPDMA_REQUEST_TIM16_COM
  *         @arg @ref LL_HPDMA_REQUEST_TIM17_COM
  *         @arg @ref LL_HPDMA_REQUEST_I3C1_RX
  *         @arg @ref LL_HPDMA_REQUEST_I3C1_TX
  *         @arg @ref LL_HPDMA_REQUEST_I3C1_CMD
  *         @arg @ref LL_HPDMA_REQUEST_I3C1_STAT
  *         @arg @ref LL_HPDMA_REQUEST_I3C2_RX
  *         @arg @ref LL_HPDMA_REQUEST_I3C2_TX
  *         @arg @ref LL_HPDMA_REQUEST_I3C2_CMD
  *         @arg @ref LL_HPDMA_REQUEST_I3C2_STAT
  *         @arg @ref LL_HPDMA_REQUEST_I3C3_RX
  *         @arg @ref LL_HPDMA_REQUEST_I3C3_TX
  *         @arg @ref LL_HPDMA_REQUEST_I3C3_CMD
  *         @arg @ref LL_HPDMA_REQUEST_I3C3_STAT
  *
  *         @arg @ref LL_LPDMA_REQUEST_LPUART1_RX
  *         @arg @ref LL_LPDMA_REQUEST_LPUART1_TX
  *         @arg @ref LL_LPDMA_REQUEST_I2C8_RX
  *         @arg @ref LL_LPDMA_REQUEST_I2C8_TX
  *         @arg @ref LL_LPDMA_REQUEST_I2C8_EVC
  *         @arg @ref LL_LPDMA_REQUEST_SPI8_RX
  *         @arg @ref LL_LPDMA_REQUEST_SPI8_TX
  *         @arg @ref LL_LPDMA_REQUEST_ADF1_FLT0
  *         @arg @ref LL_LPDMA_REQUEST_LPTIM3_IC1
  *         @arg @ref LL_LPDMA_REQUEST_LPTIM3_IC2
  *         @arg @ref LL_LPDMA_REQUEST_LPTIM3_UE
  *         @arg @ref LL_LPDMA_REQUEST_LPTIM4_IC1
  *         @arg @ref LL_LPDMA_REQUEST_LPTIM4_IC2
  *         @arg @ref LL_LPDMA_REQUEST_LPTIM4_UE
  *         @arg @ref LL_LPDMA_REQUEST_I3C4_RX
  *         @arg @ref LL_LPDMA_REQUEST_I3C4_TX
  *         @arg @ref LL_LPDMA_REQUEST_I3C4_CMD
  *         @arg @ref LL_LPDMA_REQUEST_I3C4_STAT
  */
__STATIC_INLINE  uint32_t LL_DMA_GetPeriphRequest(const DMA_TypeDef *DMAx, uint32_t Channel)
{
  uint32_t dma_base_addr = (uint32_t)DMAx;
  return (READ_BIT(((DMA_Channel_TypeDef *)(dma_base_addr + LL_DMA_CH_OFFSET_TAB[Channel]))->CTR2, DMA_CTR2_REQSEL));
}

